# config.py

# Канал, куда прилетают анкеты на проверку И улетают логи аудита
ADMIN_CHANNEL_ID = 1367623652492709928  

# Жесткая привязка рангов к ID ролей
RANKS_DATA = {
    "1": {"id": 1367623527317897408, "name": "1 | Шнырь"},
    "2": {"id": 1367623525203968133, "name": "2 | Фраер"},
    "3": {"id": 1367623524138614814, "name": "3 | Бык"},
    "4": {"id": 1367623523182448640, "name": "4 | Торпеда"},
    "5": {"id": 1367623522020757626, "name": "5 | Блатной"},
    "6": {"id": 1367623520929976471, "name": "6 | Решала"},
    "7": {"id": 1367623519072030844, "name": "7 | Бригадир"}
}

# Список дополнительных ролей, которые выдаются ВСЕМ одобренным игрокам автоматом
EXTRA_ROLES_IDS = [
    1367623531960991784,  # Белозерские
    1367969241973657770,  # Гражданин
    1367623530887254067,  # --- Доступ ---
    1367623516458975242   # Должность
]
